Revit 2026 API

# IFCCategoryTemplateFindByName Method

---

Returns mapping template element by name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCCategoryTemplate FindByName(
	Document document,
	string name
)
```
```vb
Public Shared Function FindByName (
	document As Document,
	name As String
) As IFCCategoryTemplate
```
```cpp
public:
static IFCCategoryTemplate^ FindByName(
	Document^ document,
	String^ name
)
```
```fsharp
static member FindByName :
        document : Document *
        name : string -> IFCCategoryTemplate
```

#### Parameters

document Document
     The document to find the mapping template with the specified name.
name String
     Name of the mapping template to find.

#### Return Value

IFCCategoryTemplate The mapping template element, or  if not found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCCategoryTemplate Class

Autodesk.Revit.DB Namespace